Revit 2024 API
PipeFittingAndAccessoryPressureDropItem.VelocityPressure Property
 The velocity pressure, for converting between coefficient and pressure drop on this flow path. Units: (kg/(ft·s²)).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double VelocityPressure { get; }
Visual Basic
Public ReadOnly Property VelocityPressure As Double
	Get
Visual C++
public:
property double VelocityPressure {
	double get ();
}
See Also
PipeFittingAndAccessoryPressureDropItem Class
Autodesk.Revit.DB.Plumbing Namespace